Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz2064dar169.h
extern volatile __C2RXF0bits_t C2RXF0bits __asm__ ("C2RXF0") __attribute__((section("sfrs"), address(0xBF881140)));
extern volatile uint32_t        C2RXF0CLR __attribute__((section("sfrs"),address(0xBF881144)));
extern volatile uint32_t        C2RXF0SET __attribute__((section("sfrs"),address(0xBF881148)));
extern volatile uint32_t        C2RXF0INV __attribute__((section("sfrs"),address(0xBF88114C)));
#define C2RXF1 C2RXF1
extern volatile uint32_t   C2RXF1 __attribute__((section("sfrs"), address(0xBF881150)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF1bits_t;
extern volatile __C2RXF1bits_t C2RXF1bits __asm__ ("C2RXF1") __attribute__((section("sfrs"), address(0xBF881150)));
extern volatile uint32_t        C2RXF1CLR __attribute__((section("sfrs"),address(0xBF881154)));
extern volatile uint32_t        C2RXF1SET __attribute__((section("sfrs"),address(0xBF881158)));
extern volatile uint32_t        C2RXF1INV __attribute__((section("sfrs"),address(0xBF88115C)));
#define C2RXF2 C2RXF2
extern volatile uint32_t   C2RXF2 __attribute__((section("sfrs"), address(0xBF881160)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF2bits_t;
extern volatile __C2RXF2bits_t C2RXF2bits __asm__ ("C2RXF2") __attribute__((section("sfrs"), address(0xBF881160)));
extern volatile uint32_t        C2RXF2CLR __attribute__((section("sfrs"),address(0xBF881164)));
extern volatile uint32_t        C2RXF2SET __attribute__((section("sfrs"),address(0xBF881168)));
extern volatile uint32_t        C2RXF2INV __attribute__((section("sfrs"),address(0xBF88116C)));
#define C2RXF3 C2RXF3
extern volatile uint32_t   C2RXF3 __attribute__((section("sfrs"), address(0xBF881170)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF3bits_t;
extern volatile __C2RXF3bits_t C2RXF3bits __asm__ ("C2RXF3") __attribute__((section("sfrs"), address(0xBF881170)));
extern volatile uint32_t        C2RXF3CLR __attribute__((section("sfrs"),address(0xBF881174)));
extern volatile uint32_t        C2RXF3SET __attribute__((section("sfrs"),address(0xBF881178)));
extern volatile uint32_t        C2RXF3INV __attribute__((section("sfrs"),address(0xBF88117C)));
#define C2RXF4 C2RXF4
extern volatile uint32_t   C2RXF4 __attribute__((section("sfrs"), address(0xBF881180)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF4bits_t;
extern volatile __C2RXF4bits_t C2RXF4bits __asm__ ("C2RXF4") __attribute__((section("sfrs"), address(0xBF881180)));
extern volatile uint32_t        C2RXF4CLR __attribute__((section("sfrs"),address(0xBF881184)));
extern volatile uint32_t        C2RXF4SET __attribute__((section("sfrs"),address(0xBF881188)));
extern volatile uint32_t        C2RXF4INV __attribute__((section("sfrs"),address(0xBF88118C)));
#define C2RXF5 C2RXF5
extern volatile uint32_t   C2RXF5 __attribute__((section("sfrs"), address(0xBF881190)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF5bits_t;
extern volatile __C2RXF5bits_t C2RXF5bits __asm__ ("C2RXF5") __attribute__((section("sfrs"), address(0xBF881190)));
extern volatile uint32_t        C2RXF5CLR __attribute__((section("sfrs"),address(0xBF881194)));
extern volatile uint32_t        C2RXF5SET __attribute__((section("sfrs"),address(0xBF881198)));
extern volatile uint32_t        C2RXF5INV __attribute__((section("sfrs"),address(0xBF88119C)));
#define C2RXF6 C2RXF6
extern volatile uint32_t   C2RXF6 __attribute__((section("sfrs"), address(0xBF8811A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF6bits_t;
extern volatile __C2RXF6bits_t C2RXF6bits __asm__ ("C2RXF6") __attribute__((section("sfrs"), address(0xBF8811A0)));
extern volatile uint32_t        C2RXF6CLR __attribute__((section("sfrs"),address(0xBF8811A4)));
extern volatile uint32_t        C2RXF6SET __attribute__((section("sfrs"),address(0xBF8811A8)));
extern volatile uint32_t        C2RXF6INV __attribute__((section("sfrs"),address(0xBF8811AC)));
#define C2RXF7 C2RXF7
extern volatile uint32_t   C2RXF7 __attribute__((section("sfrs"), address(0xBF8811B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF7bits_t;
extern volatile __C2RXF7bits_t C2RXF7bits __asm__ ("C2RXF7") __attribute__((section("sfrs"), address(0xBF8811B0)));
extern volatile uint32_t        C2RXF7CLR __attribute__((section("sfrs"),address(0xBF8811B4)));
extern volatile uint32_t        C2RXF7SET __attribute__((section("sfrs"),address(0xBF8811B8)));
extern volatile uint32_t        C2RXF7INV __attribute__((section("sfrs"),address(0xBF8811BC)));
#define C2RXF8 C2RXF8
extern volatile uint32_t   C2RXF8 __attribute__((section("sfrs"), address(0xBF8811C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF8bits_t;
extern volatile __C2RXF8bits_t C2RXF8bits __asm__ ("C2RXF8") __attribute__((section("sfrs"), address(0xBF8811C0)));
extern volatile uint32_t        C2RXF8CLR __attribute__((section("sfrs"),address(0xBF8811C4)));
extern volatile uint32_t        C2RXF8SET __attribute__((section("sfrs"),address(0xBF8811C8)));
extern volatile uint32_t        C2RXF8INV __attribute__((section("sfrs"),address(0xBF8811CC)));
#define C2RXF9 C2RXF9
extern volatile uint32_t   C2RXF9 __attribute__((section("sfrs"), address(0xBF8811D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF9bits_t;
extern volatile __C2RXF9bits_t C2RXF9bits __asm__ ("C2RXF9") __attribute__((section("sfrs"), address(0xBF8811D0)));
extern volatile uint32_t        C2RXF9CLR __attribute__((section("sfrs"),address(0xBF8811D4)));
extern volatile uint32_t        C2RXF9SET __attribute__((section("sfrs"),address(0xBF8811D8)));
extern volatile uint32_t        C2RXF9INV __attribute__((section("sfrs"),address(0xBF8811DC)));
#define C2RXF10 C2RXF10
extern volatile uint32_t   C2RXF10 __attribute__((section("sfrs"), address(0xBF8811E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF10bits_t;
extern volatile __C2RXF10bits_t C2RXF10bits __asm__ ("C2RXF10") __attribute__((section("sfrs"), address(0xBF8811E0)));
extern volatile uint32_t        C2RXF10CLR __attribute__((section("sfrs"),address(0xBF8811E4)));
extern volatile uint32_t        C2RXF10SET __attribute__((section("sfrs"),address(0xBF8811E8)));
extern volatile uint32_t        C2RXF10INV __attribute__((section("sfrs"),address(0xBF8811EC)));
#define C2RXF11 C2RXF11
extern volatile uint32_t   C2RXF11 __attribute__((section("sfrs"), address(0xBF8811F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF11bits_t;
