Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz2064dar169.h
extern volatile __GLCDCLUT80bits_t GLCDCLUT80bits __asm__ ("GLCDCLUT80") __attribute__((section("sfrs"), address(0xBF8EA540)));
#define GLCDCLUT81 GLCDCLUT81
extern volatile uint32_t   GLCDCLUT81 __attribute__((section("sfrs"), address(0xBF8EA544)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT81bits_t;
extern volatile __GLCDCLUT81bits_t GLCDCLUT81bits __asm__ ("GLCDCLUT81") __attribute__((section("sfrs"), address(0xBF8EA544)));
#define GLCDCLUT82 GLCDCLUT82
extern volatile uint32_t   GLCDCLUT82 __attribute__((section("sfrs"), address(0xBF8EA548)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT82bits_t;
extern volatile __GLCDCLUT82bits_t GLCDCLUT82bits __asm__ ("GLCDCLUT82") __attribute__((section("sfrs"), address(0xBF8EA548)));
#define GLCDCLUT83 GLCDCLUT83
extern volatile uint32_t   GLCDCLUT83 __attribute__((section("sfrs"), address(0xBF8EA54C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT83bits_t;
extern volatile __GLCDCLUT83bits_t GLCDCLUT83bits __asm__ ("GLCDCLUT83") __attribute__((section("sfrs"), address(0xBF8EA54C)));
#define GLCDCLUT84 GLCDCLUT84
extern volatile uint32_t   GLCDCLUT84 __attribute__((section("sfrs"), address(0xBF8EA550)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT84bits_t;
extern volatile __GLCDCLUT84bits_t GLCDCLUT84bits __asm__ ("GLCDCLUT84") __attribute__((section("sfrs"), address(0xBF8EA550)));
#define GLCDCLUT85 GLCDCLUT85
extern volatile uint32_t   GLCDCLUT85 __attribute__((section("sfrs"), address(0xBF8EA554)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT85bits_t;
extern volatile __GLCDCLUT85bits_t GLCDCLUT85bits __asm__ ("GLCDCLUT85") __attribute__((section("sfrs"), address(0xBF8EA554)));
#define GLCDCLUT86 GLCDCLUT86
extern volatile uint32_t   GLCDCLUT86 __attribute__((section("sfrs"), address(0xBF8EA558)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT86bits_t;
extern volatile __GLCDCLUT86bits_t GLCDCLUT86bits __asm__ ("GLCDCLUT86") __attribute__((section("sfrs"), address(0xBF8EA558)));
#define GLCDCLUT87 GLCDCLUT87
extern volatile uint32_t   GLCDCLUT87 __attribute__((section("sfrs"), address(0xBF8EA55C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT87bits_t;
extern volatile __GLCDCLUT87bits_t GLCDCLUT87bits __asm__ ("GLCDCLUT87") __attribute__((section("sfrs"), address(0xBF8EA55C)));
#define GLCDCLUT88 GLCDCLUT88
extern volatile uint32_t   GLCDCLUT88 __attribute__((section("sfrs"), address(0xBF8EA560)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT88bits_t;
extern volatile __GLCDCLUT88bits_t GLCDCLUT88bits __asm__ ("GLCDCLUT88") __attribute__((section("sfrs"), address(0xBF8EA560)));
#define GLCDCLUT89 GLCDCLUT89
extern volatile uint32_t   GLCDCLUT89 __attribute__((section("sfrs"), address(0xBF8EA564)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT89bits_t;
extern volatile __GLCDCLUT89bits_t GLCDCLUT89bits __asm__ ("GLCDCLUT89") __attribute__((section("sfrs"), address(0xBF8EA564)));
#define GLCDCLUT90 GLCDCLUT90
extern volatile uint32_t   GLCDCLUT90 __attribute__((section("sfrs"), address(0xBF8EA568)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT90bits_t;
extern volatile __GLCDCLUT90bits_t GLCDCLUT90bits __asm__ ("GLCDCLUT90") __attribute__((section("sfrs"), address(0xBF8EA568)));
#define GLCDCLUT91 GLCDCLUT91
extern volatile uint32_t   GLCDCLUT91 __attribute__((section("sfrs"), address(0xBF8EA56C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT91bits_t;
extern volatile __GLCDCLUT91bits_t GLCDCLUT91bits __asm__ ("GLCDCLUT91") __attribute__((section("sfrs"), address(0xBF8EA56C)));
#define GLCDCLUT92 GLCDCLUT92
extern volatile uint32_t   GLCDCLUT92 __attribute__((section("sfrs"), address(0xBF8EA570)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT92bits_t;
extern volatile __GLCDCLUT92bits_t GLCDCLUT92bits __asm__ ("GLCDCLUT92") __attribute__((section("sfrs"), address(0xBF8EA570)));
#define GLCDCLUT93 GLCDCLUT93
extern volatile uint32_t   GLCDCLUT93 __attribute__((section("sfrs"), address(0xBF8EA574)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT93bits_t;
extern volatile __GLCDCLUT93bits_t GLCDCLUT93bits __asm__ ("GLCDCLUT93") __attribute__((section("sfrs"), address(0xBF8EA574)));
#define GLCDCLUT94 GLCDCLUT94
extern volatile uint32_t   GLCDCLUT94 __attribute__((section("sfrs"), address(0xBF8EA578)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT94bits_t;
extern volatile __GLCDCLUT94bits_t GLCDCLUT94bits __asm__ ("GLCDCLUT94") __attribute__((section("sfrs"), address(0xBF8EA578)));
#define GLCDCLUT95 GLCDCLUT95
extern volatile uint32_t   GLCDCLUT95 __attribute__((section("sfrs"), address(0xBF8EA57C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT95bits_t;
extern volatile __GLCDCLUT95bits_t GLCDCLUT95bits __asm__ ("GLCDCLUT95") __attribute__((section("sfrs"), address(0xBF8EA57C)));
#define GLCDCLUT96 GLCDCLUT96
extern volatile uint32_t   GLCDCLUT96 __attribute__((section("sfrs"), address(0xBF8EA580)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT96bits_t;
extern volatile __GLCDCLUT96bits_t GLCDCLUT96bits __asm__ ("GLCDCLUT96") __attribute__((section("sfrs"), address(0xBF8EA580)));
#define GLCDCLUT97 GLCDCLUT97
extern volatile uint32_t   GLCDCLUT97 __attribute__((section("sfrs"), address(0xBF8EA584)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT97bits_t;
extern volatile __GLCDCLUT97bits_t GLCDCLUT97bits __asm__ ("GLCDCLUT97") __attribute__((section("sfrs"), address(0xBF8EA584)));
#define GLCDCLUT98 GLCDCLUT98
extern volatile uint32_t   GLCDCLUT98 __attribute__((section("sfrs"), address(0xBF8EA588)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT98bits_t;
extern volatile __GLCDCLUT98bits_t GLCDCLUT98bits __asm__ ("GLCDCLUT98") __attribute__((section("sfrs"), address(0xBF8EA588)));
#define GLCDCLUT99 GLCDCLUT99
extern volatile uint32_t   GLCDCLUT99 __attribute__((section("sfrs"), address(0xBF8EA58C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT99bits_t;
