Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz2064dar169.h
#define _SBT6ECLRM_CLEAR_POSITION                0x00000000
#define _SBT6ECLRM_CLEAR_MASK                    0x00000001
#define _SBT6ECLRM_CLEAR_LENGTH                  0x00000001

#define _SBT6REG0_SIZE_POSITION                  0x00000003
#define _SBT6REG0_SIZE_MASK                      0x000000F8
#define _SBT6REG0_SIZE_LENGTH                    0x00000005

#define _SBT6REG0_PRI_POSITION                   0x00000009
#define _SBT6REG0_PRI_MASK                       0x00000200
#define _SBT6REG0_PRI_LENGTH                     0x00000001

#define _SBT6REG0_BASE_POSITION                  0x0000000A
#define _SBT6REG0_BASE_MASK                      0xFFFFFC00
#define _SBT6REG0_BASE_LENGTH                    0x00000016

#define _SBT6RD0_GROUP0_POSITION                 0x00000000
#define _SBT6RD0_GROUP0_MASK                     0x00000001
#define _SBT6RD0_GROUP0_LENGTH                   0x00000001

#define _SBT6RD0_GROUP1_POSITION                 0x00000001
#define _SBT6RD0_GROUP1_MASK                     0x00000002
#define _SBT6RD0_GROUP1_LENGTH                   0x00000001

#define _SBT6RD0_GROUP2_POSITION                 0x00000002
#define _SBT6RD0_GROUP2_MASK                     0x00000004
#define _SBT6RD0_GROUP2_LENGTH                   0x00000001

#define _SBT6RD0_GROUP3_POSITION                 0x00000003
#define _SBT6RD0_GROUP3_MASK                     0x00000008
#define _SBT6RD0_GROUP3_LENGTH                   0x00000001

#define _SBT6WR0_GROUP0_POSITION                 0x00000000
#define _SBT6WR0_GROUP0_MASK                     0x00000001
#define _SBT6WR0_GROUP0_LENGTH                   0x00000001

#define _SBT6WR0_GROUP1_POSITION                 0x00000001
#define _SBT6WR0_GROUP1_MASK                     0x00000002
#define _SBT6WR0_GROUP1_LENGTH                   0x00000001

#define _SBT6WR0_GROUP2_POSITION                 0x00000002
#define _SBT6WR0_GROUP2_MASK                     0x00000004
#define _SBT6WR0_GROUP2_LENGTH                   0x00000001

#define _SBT6WR0_GROUP3_POSITION                 0x00000003
#define _SBT6WR0_GROUP3_MASK                     0x00000008
#define _SBT6WR0_GROUP3_LENGTH                   0x00000001

#define _SBT6REG1_SIZE_POSITION                  0x00000003
#define _SBT6REG1_SIZE_MASK                      0x000000F8
#define _SBT6REG1_SIZE_LENGTH                    0x00000005

#define _SBT6REG1_PRI_POSITION                   0x00000009
#define _SBT6REG1_PRI_MASK                       0x00000200
#define _SBT6REG1_PRI_LENGTH                     0x00000001

#define _SBT6REG1_BASE_POSITION                  0x0000000A
#define _SBT6REG1_BASE_MASK                      0xFFFFFC00
#define _SBT6REG1_BASE_LENGTH                    0x00000016

#define _SBT6RD1_GROUP0_POSITION                 0x00000000
#define _SBT6RD1_GROUP0_MASK                     0x00000001
#define _SBT6RD1_GROUP0_LENGTH                   0x00000001

#define _SBT6RD1_GROUP1_POSITION                 0x00000001
#define _SBT6RD1_GROUP1_MASK                     0x00000002
#define _SBT6RD1_GROUP1_LENGTH                   0x00000001

#define _SBT6RD1_GROUP2_POSITION                 0x00000002
#define _SBT6RD1_GROUP2_MASK                     0x00000004
#define _SBT6RD1_GROUP2_LENGTH                   0x00000001

#define _SBT6RD1_GROUP3_POSITION                 0x00000003
#define _SBT6RD1_GROUP3_MASK                     0x00000008
#define _SBT6RD1_GROUP3_LENGTH                   0x00000001

#define _SBT6WR1_GROUP0_POSITION                 0x00000000
#define _SBT6WR1_GROUP0_MASK                     0x00000001
#define _SBT6WR1_GROUP0_LENGTH                   0x00000001

#define _SBT6WR1_GROUP1_POSITION                 0x00000001
#define _SBT6WR1_GROUP1_MASK                     0x00000002
#define _SBT6WR1_GROUP1_LENGTH                   0x00000001

#define _SBT6WR1_GROUP2_POSITION                 0x00000002
#define _SBT6WR1_GROUP2_MASK                     0x00000004
#define _SBT6WR1_GROUP2_LENGTH                   0x00000001

#define _SBT6WR1_GROUP3_POSITION                 0x00000003
#define _SBT6WR1_GROUP3_MASK                     0x00000008
#define _SBT6WR1_GROUP3_LENGTH                   0x00000001

#define _SBFLAG1_T7PGV_POSITION                  0x00000000
#define _SBFLAG1_T7PGV_MASK                      0x00000001
#define _SBFLAG1_T7PGV_LENGTH                    0x00000001

#define _SBFLAG1_T8PGV_POSITION                  0x00000001
#define _SBFLAG1_T8PGV_MASK                      0x00000002
#define _SBFLAG1_T8PGV_LENGTH                    0x00000001

#define _SBFLAG1_T9PGV_POSITION                  0x00000002
#define _SBFLAG1_T9PGV_MASK                      0x00000004
#define _SBFLAG1_T9PGV_LENGTH                    0x00000001

#define _SBFLAG1_T10PGV_POSITION                 0x00000003
#define _SBFLAG1_T10PGV_MASK                     0x00000008
#define _SBFLAG1_T10PGV_LENGTH                   0x00000001

#define _SBFLAG1_T11PGV_POSITION                 0x00000004
#define _SBFLAG1_T11PGV_MASK                     0x00000010
#define _SBFLAG1_T11PGV_LENGTH                   0x00000001

#define _SBFLAG1_T12PGV_POSITION                 0x00000005
#define _SBFLAG1_T12PGV_MASK                     0x00000020
#define _SBFLAG1_T12PGV_LENGTH                   0x00000001

#define _SBFLAG1_T0PGV1_POSITION                 0x00000006
#define _SBFLAG1_T0PGV1_MASK                     0x00000040
#define _SBFLAG1_T0PGV1_LENGTH                   0x00000001

#define _SBT7ELOG1_CMD_POSITION                  0x00000000
#define _SBT7ELOG1_CMD_MASK                      0x00000007
#define _SBT7ELOG1_CMD_LENGTH                    0x00000003

#define _SBT7ELOG1_REGION_POSITION               0x00000004
#define _SBT7ELOG1_REGION_MASK                   0x000000F0
#define _SBT7ELOG1_REGION_LENGTH                 0x00000004

#define _SBT7ELOG1_INITID_POSITION               0x00000008
#define _SBT7ELOG1_INITID_MASK                   0x0000FF00
#define _SBT7ELOG1_INITID_LENGTH                 0x00000008

#define _SBT7ELOG1_CODE_POSITION                 0x00000018
#define _SBT7ELOG1_CODE_MASK                     0x0F000000
#define _SBT7ELOG1_CODE_LENGTH                   0x00000004

#define _SBT7ELOG1_MULTI_POSITION                0x0000001F
#define _SBT7ELOG1_MULTI_MASK                    0x80000000
#define _SBT7ELOG1_MULTI_LENGTH                  0x00000001

